## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.gke-cinema.google_container_cluster.primary has changed
!   resource "google_container_cluster" "primary" {
        id                          = "projects/terrateam-cinema/locations/us-central1/clusters/cinema"
        name                        = "cinema"
        # (27 unchanged attributes hidden)

!       node_pool {
            name                        = "core"
!           node_locations              = [
-               "us-central1-b",
                # (1 unchanged element hidden)
            ]
            # (6 unchanged attributes hidden)

            # (4 unchanged blocks hidden)
        }

        # (18 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.google_service_account.gke-external-dns will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_service_account" "gke-external-dns" {
+       account_id   = "external-dns@terrateam-cinema.iam.gserviceaccount.com"
+       display_name = (known after apply)
+       email        = (known after apply)
+       id           = (known after apply)
+       name         = (known after apply)
+       unique_id    = (known after apply)
    }

  # google_service_account_key.external-dns must be replaced
-/+ resource "google_service_account_key" "external-dns" {
!       id                 = "projects/terrateam-cinema/serviceAccounts/external-dns@terrateam-cinema.iam.gserviceaccount.com/keys/4a46daf08852cce2839da3ec7a8ed72c2bc6bedd" -> (known after apply)
!       name               = "projects/terrateam-cinema/serviceAccounts/external-dns@terrateam-cinema.iam.gserviceaccount.com/keys/4a46daf08852cce2839da3ec7a8ed72c2bc6bedd" -> (known after apply)
!       private_key        = (sensitive value)
!       public_key         = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMvRENDQWVTZ0F3SUJBZ0lJTm1Ub09rTFg0YzR3RFFZSktvWklodmNOQVFFRkJRQXdJREVlTUJ3R0ExVUUKQXhNVk1UQTJNall6TXpNM01qTXdNREEyTXprM05Ea3dNQ0FYRFRJeU1Ea3hPVEEyTXpnd05sb1lEems1T1RreApNak14TWpNMU9UVTVXakFnTVI0d0hBWURWUVFERXhVeE1EWXlOak16TXpjeU16QXdNRFl6T1RjME9UQXdnZ0VpCk1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLQW9JQkFRRHVUcE9Ubm1oS29RbEljK3dGMXZqZUx5bjgKcy9Ya3pTOUZWbDErYVZZbEw4bUNwd1NPemFLc3pRMlZZdHVZSUoydGtPMDF3Y3VYLzNnbjAvZDc2N1ZJVFBtaApDL0gydlVRODZZOVN3dUt3WHBvODBTNEZERWFVYTZseGlxQ1p4VTBLYlgwcFRrQ0UvMnVKczFaclZ5bVRPNFZoCjV5TUxSWmFiWDNZSEdydlhnZkIzQmJoVDNRNzBQcHB3ZXJhclVjOXVQNS84MU1QdGc0aUlDemhCL0ExQjhyZnoKYVFtVkI3ck1YemVuRmp6WGZka0xLbmlna240NmdhM1RMNDFSL2JaWkhyVzZCMXNXK0NicVpaRkplMUlhbVRmYQo1bzVjQVVKNDczK1E4ZXB0QUxTNFZsZEJEMVdYcVg2ek56RWxUZXhodFFFL0ROUXE3c3RPSm1iSFZHV3hBZ01CCkFBR2pPREEyTUF3R0ExVWRFd0VCL3dRQ01BQXdEZ1lEVlIwUEFRSC9CQVFEQWdlQU1CWUdBMVVkSlFFQi93UU0KTUFvR0NDc0dBUVVGQndNQ01BMEdDU3FHU0liM0RRRUJCUVVBQTRJQkFRQ09ueklhUVowR1c4dit2cmY2SEhHegpPNUdSRmU5RVdvTGJ0V285MG1kNTZiLzhWcHMySGxkWXVsN3lJdTY0MTZlcW5Tek9xQXZKMElkWG1pRVNna0FYCjJEYnVuOTBLeHN0NHpZc2VZS3dpQWl0ZUlTY2x4VXJqbzh6VlRQRlQ3cHdwMkF0Y0QxS2QxNzlUMUVJN3FDQ0IKc2kxMVNIbUcreElDWkdXV2M1NiszZGFxRTZPNGcxaUNNWlkzaE94WXgxRlVtZTdpWHRwb3FsQXVXY21YQUM5NgpwYU1iVFdJNGhEUlB0WGZ3d0Z5c3BnRGY3MmR2WG1FdldEWUdSRzlReHNFRzJFS3ZWVGFtRXd6RmRTZkJVM3FnCjdXMy9MSEZMV3Z1ZGxaVDhLRGJmSE41S3gwbXBlVnVuWCtIRU1laGlVbjVLMDdncHRDWjhCUWdSNWsrTm5INTMKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> (known after apply)
!       service_account_id = "projects/terrateam-cinema/serviceAccounts/external-dns@terrateam-cinema.iam.gserviceaccount.com" -> (known after apply) # forces replacement
!       valid_after        = "2022-09-19T06:38:06Z" -> (known after apply)
!       valid_before       = "9999-12-31T23:59:59Z" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # kubernetes_annotations.cinema will be updated in-place
!   resource "kubernetes_annotations" "cinema" {
!       annotations = {
+           "mesh.cloud.google.com/proxy" = jsonencode(
                {
+                   managed = "true"
                }
            )
        }
        id          = "apiVersion=v1,kind=Namespace,name=cinema"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # kubernetes_secret.external-dns-credentials will be updated in-place
!   resource "kubernetes_secret" "external-dns-credentials" {
!       data      = (sensitive value)
        id        = "dns/external-dns"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.asm.data.google_container_cluster.asm will be read during apply
  # (config refers to values not yet known)
 <= data "google_container_cluster" "asm" {
+       addons_config                     = (known after apply)
+       authenticator_groups_config       = (known after apply)
+       binary_authorization              = (known after apply)
+       cluster_autoscaling               = (known after apply)
+       cluster_ipv4_cidr                 = (known after apply)
+       confidential_nodes                = (known after apply)
+       database_encryption               = (known after apply)
+       datapath_provider                 = (known after apply)
+       default_max_pods_per_node         = (known after apply)
+       default_snat_status               = (known after apply)
+       description                       = (known after apply)
+       dns_config                        = (known after apply)
+       enable_autopilot                  = (known after apply)
+       enable_binary_authorization       = (known after apply)
+       enable_intranode_visibility       = (known after apply)
+       enable_kubernetes_alpha           = (known after apply)
+       enable_legacy_abac                = (known after apply)
+       enable_shielded_nodes             = (known after apply)
+       enable_tpu                        = (known after apply)
+       endpoint                          = (known after apply)
+       id                                = (known after apply)
+       initial_node_count                = (known after apply)
+       ip_allocation_policy              = (known after apply)
+       label_fingerprint                 = (known after apply)
+       location                          = "us-central1"
+       logging_config                    = (known after apply)
+       logging_service                   = (known after apply)
+       maintenance_policy                = (known after apply)
+       master_auth                       = (known after apply)
+       master_authorized_networks_config = (known after apply)
+       master_version                    = (known after apply)
+       mesh_certificates                 = (known after apply)
+       min_master_version                = (known after apply)
+       monitoring_config                 = (known after apply)
+       monitoring_service                = (known after apply)
+       name                              = (known after apply)
+       network                           = (known after apply)
+       network_policy                    = (known after apply)
+       networking_mode                   = (known after apply)
+       node_config                       = (known after apply)
+       node_locations                    = (known after apply)
+       node_pool                         = (known after apply)
+       node_version                      = (known after apply)
+       notification_config               = (known after apply)
+       operation                         = (known after apply)
+       private_cluster_config            = (known after apply)
+       private_ipv6_google_access        = (known after apply)
+       project                           = "terrateam-cinema"
+       release_channel                   = (known after apply)
+       remove_default_node_pool          = (known after apply)
+       resource_labels                   = (known after apply)
+       resource_usage_export_config      = (known after apply)
+       self_link                         = (known after apply)
+       service_external_ips_config       = (known after apply)
+       services_ipv4_cidr                = (known after apply)
+       subnetwork                        = (known after apply)
+       tpu_ipv4_cidr_block               = (known after apply)
+       vertical_pod_autoscaling          = (known after apply)
+       workload_identity_config          = (known after apply)
    }

  # module.asm.google_gke_hub_membership.membership[0] must be replaced
-/+ resource "google_gke_hub_membership" "membership" {
!       id            = "projects/terrateam-cinema/locations/global/memberships/cinema-membership" -> (known after apply)
-       labels        = {} -> null
!       membership_id = "cinema-membership" -> (known after apply) # forces replacement
!       name          = "projects/terrateam-cinema/locations/global/memberships/cinema-membership" -> (known after apply)
        # (1 unchanged attribute hidden)

!       endpoint {
!           gke_cluster {
!               resource_link = "//container.googleapis.com/projects/terrateam-cinema/locations/us-central1/clusters/cinema" -> (known after apply) # forces replacement
            }
        }
    }

  # module.gke-cinema.google_container_node_pool.pools["core"] must be replaced
-/+ resource "google_container_node_pool" "pools" {
!       id                          = "projects/terrateam-cinema/locations/us-central1/clusters/cinema/nodePools/core" -> (known after apply)
!       instance_group_urls         = [
-           "https://www.googleapis.com/compute/v1/projects/terrateam-cinema/zones/us-central1-a/instanceGroupManagers/gke-cinema-core-ca35a070-grp",
        ] -> (known after apply)
!       managed_instance_group_urls = [
-           "https://www.googleapis.com/compute/v1/projects/terrateam-cinema/zones/us-central1-a/instanceGroups/gke-cinema-core-ca35a070-grp",
        ] -> (known after apply)
!       max_pods_per_node           = 65 -> (known after apply)
        name                        = "core"
+       name_prefix                 = (known after apply)
!       node_count                  = 1 -> (known after apply)
+       operation                   = (known after apply)
!       version                     = "1.24.3-gke.2100" -> (known after apply)
        # (5 unchanged attributes hidden)

!       autoscaling {
-           total_max_node_count = 0 -> null
-           total_min_node_count = 0 -> null
            # (2 unchanged attributes hidden)
        }

!       node_config {
!           machine_type      = "n2-highcpu-4" -> "n2-standard-2" # forces replacement
+           min_cpu_platform  = (known after apply)
            tags              = [
                "gke-cinema",
                "gke-cinema-core",
            ]
!           taint             = [] -> (known after apply)
            # (11 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.gke-cinema.google_container_node_pool.pools["istio"] will be created
+   resource "google_container_node_pool" "pools" {
+       cluster                     = "cinema"
+       id                          = (known after apply)
+       initial_node_count          = 1
+       instance_group_urls         = (known after apply)
+       location                    = "us-central1"
+       managed_instance_group_urls = (known after apply)
+       max_pods_per_node           = (known after apply)
+       name                        = "istio"
+       name_prefix                 = (known after apply)
+       node_count                  = (known after apply)
+       node_locations              = [
+           "us-central1-a",
        ]
+       operation                   = (known after apply)
+       project                     = "terrateam-cinema"
+       version                     = (known after apply)

+       autoscaling {
+           max_node_count = 1
+           min_node_count = 1
        }

+       management {
+           auto_repair  = true
+           auto_upgrade = true
        }

+       node_config {
+           disk_size_gb      = 15
+           disk_type         = "pd-standard"
+           guest_accelerator = []
+           image_type        = "COS_CONTAINERD"
+           labels            = {
+               "cluster_name" = "cinema"
+               "node_pool"    = "istio"
            }
+           local_ssd_count   = 0
+           machine_type      = "n2-standard-2"
+           metadata          = {
+               "cluster_name"             = "cinema"
+               "disable-legacy-endpoints" = "true"
+               "node_pool"                = "istio"
            }
+           min_cpu_platform  = (known after apply)
+           oauth_scopes      = [
+               "https://www.googleapis.com/auth/logging.write",
+               "https://www.googleapis.com/auth/monitoring",
            ]
+           preemptible       = true
+           service_account   = "terrateam-tf@terrateam-cinema.iam.gserviceaccount.com"
+           spot              = false
+           tags              = [
+               "gke-cinema",
+               "gke-cinema-istio",
            ]
+           taint             = (known after apply)

+           shielded_instance_config {
+               enable_integrity_monitoring = true
+               enable_secure_boot          = false
            }

+           workload_metadata_config {
+               mode = "GKE_METADATA"
            }
        }

+       timeouts {
+           create = "45m"
+           delete = "45m"
+           update = "45m"
        }

+       upgrade_settings {
+           max_surge       = 1
+           max_unavailable = 0
        }
    }

  # module.asm.module.cpr.module.gcloud_kubectl.null_resource.additional_components[0] must be replaced
-/+ resource "null_resource" "additional_components" {
!       id       = "3313531085530502240" -> (known after apply)
!       triggers = {
-           "additional_components_command" = ".terraform/modules/asm.cpr/scripts/check_components.sh gcloud kubectl"
-           "arguments"                     = "c7f0f31297d766eb0ce61eabf5e8c427"
-           "md5"                           = "a65cfbc45ca76efed4d2aa587cee9dc6"
        } -> (known after apply) # forces replacement
    }

  # module.asm.module.cpr.module.gcloud_kubectl.null_resource.run_command[0] must be replaced
-/+ resource "null_resource" "run_command" {
!       id       = "6577249409401396083" -> (known after apply)
!       triggers = {
-           "arguments"             = "c7f0f31297d766eb0ce61eabf5e8c427"
-           "create_cmd_body"       = "cinema us-central1 terrateam-cinema false false .terraform/modules/asm/modules/asm/scripts/create_cpr.sh asm-managed regular true false"
-           "create_cmd_entrypoint" = ".terraform/modules/asm.cpr/modules/kubectl-wrapper/scripts/kubectl_wrapper.sh"
-           "gcloud_bin_abs_path"   = "/google-cloud-sdk/bin"
-           "md5"                   = "a65cfbc45ca76efed4d2aa587cee9dc6"
        } -> (known after apply) # forces replacement
    }

  # module.asm.module.cpr.module.gcloud_kubectl.null_resource.run_destroy_command[0] must be replaced
-/+ resource "null_resource" "run_destroy_command" {
!       id       = "2364266033582253090" -> (known after apply)
!       triggers = {
-           "destroy_cmd_body"       = "cinema us-central1 terrateam-cinema false false .terraform/modules/asm/modules/asm/scripts/destroy_cpr.sh asm-managed"
-           "destroy_cmd_entrypoint" = ".terraform/modules/asm.cpr/modules/kubectl-wrapper/scripts/kubectl_wrapper.sh"
-           "gcloud_bin_abs_path"    = "/google-cloud-sdk/bin"
        } -> (known after apply) # forces replacement
    }

Plan: 7 to add, 2 to change, 6 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
